[
    {
        "id": "1",
        "title": "JavaScript",
        "img": "https://www.pragimtech.com/wp-content/uploads/2019/03/java-script.jpg",
        "view": "3.5k",
        "ratings": 4.5,
        "comments": "5.3M",
        "badge": "Excellent",
        "description": "JavaScript, often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries"
    },
    {
        "id": "2",
        "title": "Python",
        "img": "https://cdn.programadoresbrasil.com.br/wp-content/uploads/2021/04/rxezjyf4ojx41-1140x694.png",
        "view": "4.5M",
        "ratings": 4,
        "comments": "6.5M",
        "badge": "New",
        "description": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured, object-oriented and functional programming."
    },
    {
        "id": "3",
        "title": "PHP",
        "img": "https://www.netsolutions.com/insights/wp-content/uploads/2021/01/What-is-PHP.jpg",
        "view": "1.2k",
        "ratings": 4.5,
        "comments": "6.7M",
        "badge": "Updated",
        "description": "PHP is a general-purpose scripting language geared toward web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1993. The PHP reference implementation is now produced by The PHP Group."
    },
    {
        "id": "4",
        "title": "C++",
        "img": "https://www.analyticsinsight.net/wp-content/uploads/2022/03/bh1-1024x725-1.jpg",
        "view": "6.4k",
        "ratings": 4.5,
        "comments": "4.8M",
        "badge": "New",
        "description": "C++ is a high-level general-purpose programming language created by Danish computer scientist Bjarne Stroustrup as an extension of the C programming language, or C with Classes"
    },
    {
        "id": "5",
        "title": "Ruby",
        "img": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20190902124355/ruby-programming-language.png",
        "view": "8.1k",
        "ratings": 3.5,
        "comments": "9.4M",
        "badge": "Excellent",
        "description": "Ruby is an interpreted, high-level, general-purpose programming language which supports multiple programming paradigms. It was designed with an emphasis on programming productivity and simplicity. In Ruby, everything is an object, including primitive data types."
    },
    {
        "id": "6",
        "title": "Perl",
        "img": "https://upload.wikimedia.org/wikipedia/en/thumb/5/56/Perl_language_logo.svg/1200px-Perl_language_logo.svg.png",
        "view": "2.5k",
        "ratings": 3,
        "comments": "4.6M",
        "badge": "Updated",
        "description": "Perl is a family of two high-level, general-purpose, interpreted, dynamic programming languages. Perl refers to Perl 5, but from 2000 to 2019 it also referred to its redesigned sister language, Perl 6, before the latter's name was officially changed to Raku in October 2019."
    },
    {
        "id": "7",
        "title": ".NET",
        "img": "https://dejanstojanovic.net/media/131809/1x1.png",
        "view": "3.7k",
        "ratings": 2.5,
        "comments": "8.2M",
        "badge": "New",
        "description": ".NET is a free and open-source, managed computer software framework for Windows, Linux, and macOS operating systems. It is a cross-platform successor to .NET Framework. The project is primarily developed by Microsoft employees by way of the .NET Foundation, and released under the MIT License."
    },
    {
        "id": "8",
        "title": "Java",
        "img": "https://techhubsolutions.in/wp-content/uploads/2021/10/java-training.jpg",
        "view": "9.7k",
        "ratings": 5,
        "comments": "9.1M",
        "badge": "Updated",
        "description": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible."
    },
    {
        "id": "9",
        "title": "C#",
        "img": "https://www.simplilearn.com/ice9/free_resources_article_thumb/Csharp_Programming_for_Beginners.jpg",
        "view": "4.6k",
        "ratings": 4,
        "comments": "1.8M",
        "badge": "Updated",
        "description": "C# is a general-purpose, high-level multi-paradigm programming language. C# encompasses static typing, strong typing, lexically scoped, imperative, declarative, functional, generic, object-oriented, and component-oriented programming disciplines."
    },
    {
        "id": "10",
        "title": "Scala",
        "img": "https://icons-for-free.com/iconfiles/png/512/scala+original+wordmark-1324760571144811667.png",
        "view": "6.8k",
        "ratings": 3.5,
        "comments": "5.6M",
        "badge": "New",
        "description": "Scala is a strong statically typed general-purpose programming language which supports both object-oriented programming and functional programming. Designed to be concise, many of Scala's design decisions are aimed to address criticisms of Java."
    }
]